package udemy.pojo;
//ΕΛΕΓΧΟΣ ΚΛΑΣΗΣ ΚΑΙ ΔΗΜΙΟΥΡΓΙΑ ΑΝΤΙΚΕΙΜΕΝΟΥ
//ΜΕ ΠΕΡΑΣΜΑ ΕΝΟΣ ΑΛΦΑΡΙΘΜΗΤΙΚΟΥ ΣΤΗ ΜΕΘΟΔΟ

import java.util.Scanner;
/*δήλωση import + πακέτο βιβλιοθήκης java.util,
ώστε να χρησιμοποιήσουμε την έτοιμη κλάση εκχώρησης
χαρακτήρων από το πληκτρολόγιο του χρήστη*/

public class GradeBookTest {
    /*Δημιουργία προσβάσιμης από όλες τις κλάσεις
    κλάση*/

    public static void main(String[] args){
        /*Είναι η βασική μέθοδος εκκίνησης του προγράμματος
        που εμπεριέχει τον τροποποιητή πρόσβασης public, τον
        στατικό τροποποιητή static (που δε χρειάζεται
        δημιουργία στιγμιότυπου, για να εκτελεσθεί η κλάση
        από τον jvm) και τον τύπο της περιττής επιστροφής void
        (αφού η κύρια αυτή μέθοδο εκκίνησης δεν έχει τίποτα για
        επιστροφή)*/

        Scanner input = new Scanner (System.in);
        /*Πρόταση εκχώρησης-αρχικοποίησης μεταβλητής
         όπου έχουμε με σειρά: τον τύπο, το όνομα, τον
         τελεστή της εκχώρησης, τη λέξη κλειδί, το αντικείμενο
         Scanner και το κανάλι εισόδου (input stream)*/

        GradeBook myGradeBook = new GradeBook();
        /*Η μεταβλητή myGradeBook εκκινείται-αρχικοποιείται
         από τη στιγμιοτυπική έκφραση για τη δημιουργία
         του αντικειμένου new GradeBook της κλάσης GradeBook.
         Η λέξη-κλειδί new δημιουργεί το αντικείμενο Gradebook
         με έναν () κονστράκτορα, εντός του οποίου καθορίζονται
         τα δεδομένα του αντικειμένου*/

        System.out.println("Please enter the name of the course");
        String nameOfCourse = input.nextLine();
         /*Χρήση της μεθόδου nextLine() της μεταβλητής input,
          για να δεχθεί έναν ακέραιο από τον χρήστη*/
        System.out.println();

        myGradeBook.displayMessage(nameOfCourse);
        /*Ακριβώς όπως μπορούμε να καλέσουμε τις μεθόδους
        print (σκέτο, f, ln), χρησιμοποιώντας την προκαθορισμένη
        κλάση System και τον τελεστή της τελείας που καλεί την
        ιδιότητα out, έτσι κάνουμε και με τη μεταβλητή
        που δημιουργήσαμε στην προηγούμενη κλάση. Στην
        προκειμένη περίπτωση καλούμε τη μέθοδο displayMessage
        της μεταβλητής myGradeBook και η μεταβλητή nameOfCourse
        γίνεται τιμή-όρισμα της παραμέτρου
        courseName της μεθόδου displayName*/

    }//Τέλος μεθόδου: main
}//Τέλος κλάσης: GradeBookTest
